step-by-step/030-populate-database/020-soap/0200-справочник-сущностей/0100.xml

<?xml version="1.0" ?>
<!-- Справочники -> Атрибуты -> Сущности -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:entitySpecUpdate xmlns:common="http://common.bitel.ru"
                              xmlns:ns5="http://service.common.entity.kernel.oss.bitel.ru/"
                              xmlns:xs="http://www.w3.org/2001/XMLSchema"
                              xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <arg0 xmlns="" id="-1" title="Коммутатор доступа" entityTitleMacros="$title ($attr(1))" hidden="false">
                <attributeList>
                    <attributeList id="1" title="Адрес">
                        <comment></comment>
                        <history>false</history>
                        <type>8</type>
                    </attributeList>
                    <attributeList id="2" title="Серийный номер">
                        <comment></comment>
                        <history>false</history>
                        <type>1</type>
                    </attributeList>
                </attributeList>
                <comment></comment>
            </arg0>
        </ns5:entitySpecUpdate>
    </S:Body>
</S:Envelope>
